venu-madhav-anyam/STM32/41_External_Flash_with_Ultrasonic/Src/main.c
/**
 ******************************************************************************
 * @file           : main.c
 * @author         : Auto-generated by STM32CubeIDE
 * @brief          : Main program body
 ******************************************************************************
 * @attention
 *
 * Copyright (c) 2026 STMicroelectronics.
 * All rights reserved.
 *
 * This software is licensed under terms that can be found in the LICENSE file
 * in the root directory of this software component.
 * If no LICENSE file comes with this software, it is provided AS-IS.
 *
 ******************************************************************************
 */
#include "stm32l476xx.h"
#include "stm32l476xx_spi.h"
#include "stm32l476xx_gpio.h"
#include "w25qxx.h"
#include <string.h>
#include <stdio.h>


#define TRIG_PIN  0   // PA0
#define ECHO_PIN  1   // PA1

void delay_us(uint32_t time) {
	for (uint32_t i = 0; i < time * 10; i++)
		;
}

void delay_ms(uint32_t time) {
	for (uint32_t i = 0; i < time * 8000; i++)
		__asm("nop");
}

/* -------- SENSOR INIT -------- */
void Ultrasonic_Init(void) {
	GPIO_Handle_t trig, echo;

	/* TRIG → OUTPUT */
	trig.pGPIOx = GPIOA;
	trig.GPIO_PinConfig.GPIO_PinNumber = TRIG_PIN;
	trig.GPIO_PinConfig.GPIO_PinMode = GPIO_MODE_OUTPUT;
	trig.GPIO_PinConfig.GPIO_PinSpeed = GPIO_SPEED_LOW;
	trig.GPIO_PinConfig.GPIO_PinOPType = GPIO_OP_TYPE_PP;
	trig.GPIO_PinConfig.GPIO_PinPuPdControl = GPIO_NO_PUPD;

	GPIO_Init(&trig);

	/* ECHO → INPUT */
	echo.pGPIOx = GPIOA;
	echo.GPIO_PinConfig.GPIO_PinNumber = ECHO_PIN;
	echo.GPIO_PinConfig.GPIO_PinMode = GPIO_MODE_INPUT;
	echo.GPIO_PinConfig.GPIO_PinSpeed = GPIO_SPEED_LOW;
	echo.GPIO_PinConfig.GPIO_PinPuPdControl = GPIO_NO_PUPD;

	GPIO_Init(&echo);
}

/* -------- READ DISTANCE -------- */
uint32_t Ultrasonic_Read(void) {
	uint32_t time = 0;
	uint32_t timeout;

	/* Send trigger pulse */
	GPIO_WriteToOutputPin(GPIOA, TRIG_PIN, 0);
	delay_us(2);

	GPIO_WriteToOutputPin(GPIOA, TRIG_PIN, 1);
	delay_us(10);

	GPIO_WriteToOutputPin(GPIOA, TRIG_PIN, 0);

	/* Wait for ECHO HIGH */
	timeout = 30000;

	while (GPIO_ReadFromInputPin(GPIOA, ECHO_PIN) == 0) {
		if (--timeout == 0)
			return 0;
	}

	/* Measure HIGH duration */
	//timeout = 30000;
	while (GPIO_ReadFromInputPin(GPIOA, ECHO_PIN) == 1) {
		time++;
		__asm("nop");

	}

	return time;
}

float dist;

int main(void) {

	Ultrasonic_Init();

	while (1) {
		uint32_t time = Ultrasonic_Read();

		dist = time / 38.00;

		delay_ms(10);

	}
}
